Enterprise_Serivces/Prod/SilverGroup2/CSLRealmAssociationService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/realmassociation/contracts/2010/05/IRealmAssociationService/GetAssociationByHandle</wsa:Action><wsa:MessageID>uuid:3583b3c2-e5fe-4ac8-bca3-5e230cac60a9</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslrealmassociationserviceqa1.testgs.pvt/RealmAssociationService.svc</wsa:To></soap:Header><soap:Body><GetAssociationByHandle xmlns="http://www.gamestop.com/services/csl/realmassociation/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><AssociationHandle xmlns="http://www.gamestop.com/services/csl/realmassociation/messages/2010/05">3</AssociationHandle><DistinguishingFactor xmlns="http://www.gamestop.com/services/csl/realmassociation/messages/2010/05">4</DistinguishingFactor></request></GetAssociationByHandle></soap:Body></soap:Envelope>